[
  {
    "id": "Michael R.",
    "review": "Rented a car for a week-long business trip in London — absolutely seamless experience. The car was clean, efficient, and the pickup took less than 10 minutes. Highly recommend!"
  },
  {
    "id": "Sofia G.",
    "review": "Bought my first car from this dealership and the team was wonderful! They were honest, patient, and helped me find exactly what I needed within my price range."
  },
  {
    "id": "Adewale O.",
    "review": "Easily the best rental service I’ve used in Lagos. Transparent pricing, friendly staff, and the vehicle was in top condition. I’ll definitely be back!"
  },
  {
    "id": "Layla H.",
    "review": "Exceptional service! The staff made my car purchase smooth and stress-free. They explained everything clearly and ensured I was fully confident before driving off."
  },
  {
    "id": "Jonas K.",
    "review": "Booked a rental last minute for a trip across Germany. They managed everything perfectly — quick response, reliable car, and fair pricing. Fantastic experience!"
  },
  {
    "id": "Chloe D.",
    "review": "From browsing to buying, everything was easy and transparent. Fair deals, well-maintained cars, and excellent follow-up support. This is how a dealership should operate!"
  },
  {
    "id": "Tariq M.",
    "review": "I’ve rented from many companies, but this one stands out. Professional, efficient, and the cars are always spotless. The whole process was a breeze."
  },
  {
    "id": "Mei L.",
    "review": "Purchased a pre-owned car and was impressed with the honesty and professionalism. They shared full maintenance records and even helped with registration. Highly trustworthy!"
  },
  {
    "id": "Carlos E.",
    "review": "Superb rental service in Madrid! The online booking was simple, and the car exceeded expectations. Smooth pickup and return — five stars from me."
  },
  {
    "id": "Amina S.",
    "review": "I’ve been both a rental and purchase customer here, and every time the service is top-notch. The team genuinely cares and remembers returning clients — that says a lot."
  }
]
